Revit 2027 API
MaterialNode.Smoothness Property
 The level of smoothness of the material.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int Smoothness { get; }
Public ReadOnly Property Smoothness As Integer
	Get
public:
property int Smoothness {
	int get ();
}
member Smoothness : int with get
Property Value
Int32
See Also
Reference
MaterialNode Class
Autodesk.Revit.DB Namespace